student-hub-backend/app/serializers/project_serializer.rb

SELECT "skills".* FROM "skills" INNER JOIN "project_skills" ON "skills"."id" = "project_skills"."skill_id" WHERE "project_skills"."project_id" = '1d8159e5-a047-4a6c-8104-ea665354c6ca' ORDER BY "skills"."name" ASC
---
  def skills
    object.skills.order(:name).map do |s|