student-hub-backend/app/controllers/api/v1/me/profiles_controller.rb

        def update
          profile = current_user.profile

          ActiveRecord::Base.transaction do
            if user_params.present?
              current_user.update!(user_params)
            end
            if profile_params.present?
              profile.update!(profile_params)
---
UPDATE "profiles" SET "bio" = 'i am GREAT', "birthdate" = NULL, "looking_for" = 1, "tagline" = 'Builder · Designer · Dreamer', "university" = 'UCSD', "updated_at" = '2026-09-19 11:18:34.210556' WHERE "profiles"."id" = '3ba948ec-9db5-4762-82d8-fcf9e4d3b990'
UPDATE "users" SET "updated_at" = '2026-09-19 11:17:51.277098', "name" = 'plumbing' WHERE "users"."id" = 'c4b38885-f504-4898-906b-24941fabb892'