student-hub-backend/app/controllers/api/v1/me/settings_controller.rb

UPDATE "user_settings" SET "notify_email" = FALSE, "updated_at" = '2026-09-20 09:35:32.608277' WHERE "user_settings"."id" = '3fb12428-9c56-4f57-862e-36a2d0eb5953'
---
        def apply_notification_updates
          n = settings_params[:notifications]
          return if n.blank?

          current_user.setting.update!(notification_attrs(n))

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."user_id" = 'c4b38885-f504-4898-906b-24941fabb892' LIMIT 1
UPDATE "user_settings" SET "show_online_status" = FALSE, "updated_at" = '2026-09-20 09:39:04.965613' WHERE "user_settings"."id" = '3fb12428-9c56-4f57-862e-36a2d0eb5953'
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 'c4b38885-f504-4898-906b-24941fabb892' LIMIT 1
UPDATE "profiles" SET "show_on_explore" = FALSE, "updated_at" = '2026-09-20 09:39:07.442871' WHERE "profiles"."id" = '3ba948ec-9db5-4762-82d8-fcf9e4d3b990'
---
        def apply_privacy_updates
          p = settings_params[:privacy]
          return if p.blank?

          user_setting_keys = %i[show_online_status show_last_active]
          profile_keys      = %i[profile_visibility show_on_explore]

          user_attrs    = p.slice(*user_setting_keys).to_h
          profile_attrs = p.slice(*profile_keys).to_h

          current_user.setting.update!(user_attrs)    if user_attrs.present?
          current_user.profile.update!(profile_attrs) if profile_attrs.present?

SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."user_id" = 'c4b38885-f504-4898-906b-24941fabb892' LIMIT 1
UPDATE "user_settings" SET "discovery_radius" = 201, "updated_at" = '2026-09-20 09:38:40.087854' WHERE "user_settings"."id" = '3fb12428-9c56-4f57-862e-36a2d0eb5953'
---
        def apply_preference_updates
          p = settings_params[:preferences]
          return if p.blank?

          pref_keys = %i[theme language discovery_radius]
          attrs = p.slice(*pref_keys).to_h

          current_user.setting.update!(attrs) if attrs.present?