student-hub-backend/app/controllers/api/v1/conversations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ('365c08a5-fe90-4923-9502-a78fbbdf6567', 'c4b38885-f504-4898-906b-24941fabb892')
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = '733b3ff7-ff16-444a-b708-399b0ff873c0' ORDER BY "messages"."created_at" DESC, "messages"."id" DESC LIMIT 30
---
      def index
        # Scope: conversations whose match includes the current user.
        scope = Conversation
          .joins(:match)
          .where(
            "matches.user_id = :id OR matches.matched_user_id = :id",
            id: current_user.id
          )
          .includes(:match, :messages)
          .recent_first

        result = Pagination.paginate(
          scope,
          page:     params[:page],
          per_page: params[:per_page]
        )

SELECT "users".* FROM "users" WHERE "users"."id" IN ('365c08a5-fe90-4923-9502-a78fbbdf6567', 'c4b38885-f504-4898-906b-24941fabb892')
---
      def show
        conversation = find_own_conversation!(params[:id])

        # Mark messages from the other user as read (as of now).
        mark_unread_messages_as_read!(conversation)

        # Serialize conversation with a preview of the most recent messages.
        # Full message pagination is via GET /conversations/:id/messages.
        conversation_json = ActiveModelSerializers::SerializableResource.new(
          conversation,
          serializer: ConversationSerializer,
          viewer:     current_user
        ).as_json

        recent_messages = conversation
          .messages
          .recent_first
          .limit(30)
          .includes(:user)

UPDATE "messages" SET "read_at" = '2026-09-20 06:54:39.311295' WHERE "messages"."conversation_id" = '733b3ff7-ff16-444a-b708-399b0ff873c0' AND "messages"."user_id" != 'c4b38885-f504-4898-906b-24941fabb892' AND "messages"."read_at" IS NULL
---
      def mark_unread_messages_as_read!(conversation)
        conversation
          .messages
          .where.not(user_id: current_user.id)
          .where(read_at: nil)
          .update_all(read_at: Time.current)