student-hub-backend/app/controllers/api/v1/discovery_controller.rb

        scope = Profile
          .discoverable
          .where.not(user_id: current_user.id)
          .where.not(user_id: acted_on_ids)
          .includes(user: [:interests, :skills, :portfolio_links])
          .order(created_at: :desc)

        result = Pagination.paginate(
          scope,
          page:     params[:page],
          per_page: params[:per_page]
        )
---
SELECT "portfolio_links".* FROM "portfolio_links" WHERE "portfolio_links"."user_id" IN ('4dc87d4b-2182-4cf2-b5bc-7d4f47152efc', '8e18890b-0905-48a0-9f5a-01aa368e30fe', '05b392d3-cdbe-4961-b071-6a8751c326ed', '365c08a5-fe90-4923-9502-a78fbbdf6567')
SELECT "user_interests".* FROM "user_interests" WHERE "user_interests"."user_id" IN ('4dc87d4b-2182-4cf2-b5bc-7d4f47152efc', '8e18890b-0905-48a0-9f5a-01aa368e30fe', '05b392d3-cdbe-4961-b071-6a8751c326ed', '365c08a5-fe90-4923-9502-a78fbbdf6567')
SELECT "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" IN ('4dc87d4b-2182-4cf2-b5bc-7d4f47152efc', '8e18890b-0905-48a0-9f5a-01aa368e30fe', '05b392d3-cdbe-4961-b071-6a8751c326ed', '365c08a5-fe90-4923-9502-a78fbbdf6567')

      def find_target_user!
        target = User.includes(:profile).find_by(id: params[:user_id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = '365c08a5-fe90-4923-9502-a78fbbdf6567'
SELECT "users".* FROM "users" WHERE "users"."id" = '365c08a5-fe90-4923-9502-a78fbbdf6567' LIMIT 1