student-hub-backend/app/controllers/api/v1/messages_controller.rb

INSERT INTO "messages" ("conversation_id", "user_id", "content", "read_at", "created_at", "updated_at") VALUES ('733b3ff7-ff16-444a-b708-399b0ff873c0', 'c4b38885-f504-4898-906b-24941fabb892', 'hi', NULL, '2026-09-20 06:54:44.446127', '2026-09-20 06:54:44.446127') RETURNING "id"
---
      def create
        conversation = find_own_conversation!(params[:conversation_id])

        message = conversation.messages.new(message_params)
        message.user = current_user

        if message.save