student-hub-backend/app/controllers/api/v1/profiles_controller.rb

        scope = Profile
          .discoverable
          .where.not(user_id: current_user.id)
          .includes(user: [:interests, :skills, :portfolio_links])
          .order(created_at: :desc)

        result = Pagination.paginate(
          scope,
          page:     params[:page],
          per_page: params[:per_page]
        )
---
SELECT "portfolio_links".* FROM "portfolio_links" WHERE "portfolio_links"."user_id" = '4dc87d4b-2182-4cf2-b5bc-7d4f47152efc'
SELECT "user_interests".* FROM "user_interests" WHERE "user_interests"."user_id" = '4dc87d4b-2182-4cf2-b5bc-7d4f47152efc'
SELECT "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" = '4dc87d4b-2182-4cf2-b5bc-7d4f47152efc'