student-hub-backend/app/controllers/api/v1/projects_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ('c4b38885-f504-4898-906b-24941fabb892', '365c08a5-fe90-4923-9502-a78fbbdf6567')
---
        scope = Project
          .includes(:user, :skills)
          .recent_first
          .search(params[:q])
          .by_category(params[:category])
          .owned_by(params[:owner_id])

        result = Pagination.paginate(
          scope,
          page:     params[:page],
          per_page: params[:per_page]
        )

SELECT "users".* FROM "users" WHERE "users"."id" = 'c4b38885-f504-4898-906b-24941fabb892'
---
      def show
        project = Project.includes(:user, :skills).find(params[:id])