student-hub-backend/app/controllers/api/v1/auth/registrations_controller.rb

        def create
          user = User.new(sign_up_params)

          if user.save
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES ('2026-09-11 10:28:02.702783', NULL, NULL, 'curl-test@example.com', '$2a$12$Stq7Xb.0PGNQq9IGCBQSW.AJSvQSPoJUqW80cvnCqNvwI3XYPt2tq', NULL, NULL, NULL, NULL, NULL, 0, '2026-09-11 10:28:02.702783') RETURNING "id"