student-hub-backend/app/controllers/api/v1/auth/sessions_controller.rb

        def create
          user = User.find_by(email: login_params[:email]&.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'curl-test@example.com' LIMIT 1