student-hub-backend/app/models/match.rb

  def self.create_between!(user_a, user_b)
---
INSERT INTO "matches" ("user_id", "matched_user_id", "created_at", "updated_at") VALUES ('4dc87d4b-2182-4cf2-b5bc-7d4f47152efc', '8e18890b-0905-48a0-9f5a-01aa368e30fe', '2026-09-17 11:18:28.666876', '2026-09-17 11:18:28.666876') RETURNING "id"

  def create_conversation!
    Conversation.create!(match: self)
---
INSERT INTO "conversations" ("match_id", "last_message_at", "created_at", "updated_at") VALUES ('f404f71e-103c-45ea-a266-19b402041b36', NULL, '2026-09-17 11:18:28.699027', '2026-09-17 11:18:28.699027') RETURNING "id"