student-hub-backend/app/models/message.rb

UPDATE "conversations" SET "last_message_at" = '2026-09-17 11:23:49.983003' WHERE "conversations"."id" = '6b337211-ea23-4951-9006-7b880b8fd383'
---
  def touch_conversation
    conversation.update_column(:last_message_at, created_at)