student-hub-backend/app/services/connections/record_action.rb

    def call
      unless ALLOWED_ACTIONS.include?(@action)
        raise ArgumentError, "Invalid action: #{@action}"
      end

      if @user.id == @target_user.id
        raise ArgumentError, "Cannot act on yourself"
      end

      connection = nil
      match      = nil

      ActiveRecord::Base.transaction do
        connection = Connection.find_or_initialize_by(
          user_id:        @user.id,
          target_user_id: @target_user.id
        )
---
SELECT "connections".* FROM "connections" WHERE "connections"."user_id" = 'c4b38885-f504-4898-906b-24941fabb892' AND "connections"."target_user_id" = '365c08a5-fe90-4923-9502-a78fbbdf6567' LIMIT 1