student-hub-backend/app/services/interests/replace_user_interests.rb

SELECT "interests"."id" FROM "interests" INNER JOIN "user_interests" ON "interests"."id" = "user_interests"."interest_id" WHERE "user_interests"."user_id" = 'c4b38885-f504-4898-906b-24941fabb892' AND "interests"."is_custom" = TRUE
DELETE FROM "user_interests" WHERE "user_interests"."id" = 'd4d9ced1-fd8d-42aa-b54f-38d484a1e03f'
INSERT INTO "user_interests" ("created_at", "interest_id", "updated_at", "user_id") VALUES ('2026-09-19 11:18:34.364848', '9b1c878f-8438-4ef9-9026-eff93e495a25', '2026-09-19 11:18:34.364848', 'c4b38885-f504-4898-906b-24941fabb892') RETURNING "id"
---
    def call
      # Capture the old custom interest IDs before replacing them, so
      # we can garbage-collect any that end up orphaned.
      previous_custom_interest_ids = @user.interests
        .where(is_custom: true)
        .pluck(:id)

      ActiveRecord::Base.transaction do
        @user.user_interests.destroy_all

        deduplicated_names.each do |name|
          interest = find_or_create_interest(name)
          @user.user_interests.create!(interest: interest)

SELECT "interests".* FROM "interests" WHERE (LOWER(name) = 'design') LIMIT 1
INSERT INTO "interests" ("created_at", "is_custom", "name", "updated_at") VALUES ('2026-09-19 11:18:34.344410', TRUE, 'Design', '2026-09-19 11:18:34.344410') RETURNING "id"
---
    def find_or_create_interest(name)
      interest = Interest.find_by("LOWER(name) = ?", name.downcase)
      return interest if interest

      Interest.create!(name: name, is_custom: true)

DELETE FROM "interests" WHERE ("interests"."id") IN (SELECT "interests"."id" FROM "interests" LEFT OUTER JOIN "user_interests" ON "user_interests"."interest_id" = "interests"."id" WHERE "interests"."id" IN ('9b1c878f-8438-4ef9-9026-eff93e495a25', '8abcd59d-cff0-4751-a8bc-6b99e9dd2f44', 'c4787a80-3ff4-4165-a39e-5088823abcc1', 'e984a1a9-0a69-48bd-9e87-2f21fe653067') AND "interests"."is_custom" = TRUE AND "user_interests"."id" IS NULL)
---
    def cleanup_orphaned_custom_interests(interest_ids)
      return if interest_ids.empty?

      # Only delete custom interests that are no longer attached to any user
      Interest
        .where(id: interest_ids, is_custom: true)
        .where.missing(:user_interests)
        .delete_all