student-hub-backend/app/services/skills/replace_user_skills.rb

SELECT "skills"."id" FROM "skills" INNER JOIN "user_skills" ON "skills"."id" = "user_skills"."skill_id" WHERE "user_skills"."user_id" = 'c4b38885-f504-4898-906b-24941fabb892' AND "skills"."is_custom" = TRUE
DELETE FROM "user_skills" WHERE "user_skills"."id" = '687d2330-e183-444c-a1a3-2a9e6facf7f1'
INSERT INTO "user_skills" ("created_at", "skill_id", "updated_at", "user_id") VALUES ('2026-09-19 11:18:34.566212', '14ae77a5-47ab-435b-a222-21be620a1745', '2026-09-19 11:18:34.566212', 'c4b38885-f504-4898-906b-24941fabb892') RETURNING "id"
---
    def call
      previous_custom_skill_ids = @user.skills
        .where(is_custom: true)
        .pluck(:id)

      ActiveRecord::Base.transaction do
        @user.user_skills.destroy_all

        deduplicated_names.each do |name|
          skill = find_or_create_skill(name)
          @user.user_skills.create!(skill: skill)

SELECT "skills".* FROM "skills" WHERE (LOWER(name) = 'python') LIMIT 1
INSERT INTO "skills" ("created_at", "is_custom", "name", "updated_at") VALUES ('2026-09-19 11:18:34.553507', TRUE, 'python', '2026-09-19 11:18:34.553507') RETURNING "id"
---
    def find_or_create_skill(name)
      skill = Skill.find_by("LOWER(name) = ?", name.downcase)
      return skill if skill

      Skill.create!(name: name, is_custom: true)

DELETE FROM "skills" WHERE ("skills"."id") IN (SELECT "skills"."id" FROM "skills" LEFT OUTER JOIN "user_skills" ON "user_skills"."skill_id" = "skills"."id" WHERE "skills"."id" IN ('14ae77a5-47ab-435b-a222-21be620a1745', 'b15b7dea-502c-4c79-8843-45f0ad42bed1', 'd99484a5-f66f-4d03-b96c-b075c83c5b1f') AND "skills"."is_custom" = TRUE AND "user_skills"."id" IS NULL)
---
    def cleanup_orphaned_custom_skills(skill_ids)
      return if skill_ids.empty?

      Skill
        .where(id: skill_ids, is_custom: true)
        .where.missing(:user_skills)
        .delete_all